Public Member Functions | List of all members
API_IACEventNotifier Class Referenceabstract
Notifications Manager
Defining an interface for a class that will be used to notify event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IACEventNotifier:
 Public Member Functions
virtual void  | NotifyAttributeChanges (const API_IAttributeEventHandler &eventHandler) const =0
Notifies the event handler about the attribute changes.
virtual void  | NotifyAttributeFolderChanges (const API_IAttributeFolderEventHandler &eventHandler) const =0
Notifies the event handler about the attribute folder changes.
virtual void  | NotifyClassificationItemChanges (const API_IClassificationItemEventHandler &eventHandler) const =0
Notifies the event handler about the classification item changes.
virtual void  | NotifyClassificationSystemChanges (const API_IClassificationSystemEventHandler &eventHandler) const =0
Notifies the event handler about the classification system changes.
virtual void  | NotifyPropertyGroupChanges (const API_IPropertyGroupEventHandler &eventHandler) const =0
Notifies the event handler about property group changes.
virtual void  | NotifyPropertyDefinitionChanges (const API_IPropertyDefinitionEventHandler &eventHandler) const =0
Notifies the event handler about property definition changes.
virtual void  | NotifyGraphisoftIDChanges (const API_IGraphisoftIDEventHandler &eventHandler) const =0
Notifies the event handler when Graphisoft ID is changed.
virtual void  | NotifyEnableAllDialogInfoEvent (const API_IEnableAllInfoDialogEventHandler &eventHandler) const =0
Notifies the event handler when the user enables all informational dialogs.
virtual void  | NotifyMarqueeEvent (const API_IMarqueeEventHandler &eventHandler) const =0
Notifies the event handler about the marquee event.
virtual void  | NotifyWindowChanges (const API_IWindowEventHandler &eventHandler) const =0
Notifies the event handler about window changes.
Detailed Description
Defining an interface for a class that will be used to notify event handlers.
Since
Archicad 28
Member Function Documentation
◆ NotifyAttributeChanges()
 virtual void API_IACEventNotifier::NotifyAttributeChanges  |  ( |  const API_IAttributeEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about the attribute changes.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyAttributeFolderChanges()
 virtual void API_IACEventNotifier::NotifyAttributeFolderChanges  |  ( |  const API_IAttributeFolderEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about the attribute folder changes.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyClassificationItemChanges()
 virtual void API_IACEventNotifier::NotifyClassificationItemChanges  |  ( |  const API_IClassificationItemEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about the classification item changes.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyClassificationSystemChanges()
 virtual void API_IACEventNotifier::NotifyClassificationSystemChanges  |  ( |  const API_IClassificationSystemEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about the classification system changes.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyEnableAllDialogInfoEvent()
 virtual void API_IACEventNotifier::NotifyEnableAllDialogInfoEvent  |  ( |  const API_IEnableAllInfoDialogEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler when the user enables all informational dialogs.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyGraphisoftIDChanges()
 virtual void API_IACEventNotifier::NotifyGraphisoftIDChanges  |  ( |  const API_IGraphisoftIDEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler when Graphisoft ID is changed.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyMarqueeEvent()
 virtual void API_IACEventNotifier::NotifyMarqueeEvent  |  ( |  const API_IMarqueeEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about the marquee event.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyPropertyDefinitionChanges()
 virtual void API_IACEventNotifier::NotifyPropertyDefinitionChanges  |  ( |  const API_IPropertyDefinitionEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about property definition changes.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyPropertyGroupChanges()
 virtual void API_IACEventNotifier::NotifyPropertyGroupChanges  |  ( |  const API_IPropertyGroupEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about property group changes.
Parameters
eventHandler | An instance that handles the event.
◆ NotifyWindowChanges()
 virtual void API_IACEventNotifier::NotifyWindowChanges  |  ( |  const API_IWindowEventHandler &  |  eventHandler | ) |   const
pure virtual
Notifies the event handler about window changes.
Parameters
eventHandler | An instance that handles the event.